root_path = "D:\dev\kungfu_script2"

pkgs = [(731, 426), (731, 490), (733, 547)]  # 背包坐标
cell_first = (775, 430)  # 左上角背包格子坐标
cell_width = 35  # 格子宽度
cell_length_num, cell_width_num = 7, 5  # 格子长高多少个
ok = (470, 430)  # 确定
close_repo = (687, 255)
foot = (510, 467)  # 归位坐标
center = (520, 400)
radus = 270
map_img_info = (883, 34, 145, 172)
fight_img_info = (173, 33, 28, 28)
task_image_position = (725, 440, 270, 100)
init_position = (656, 528)

up = (530, 100)
left = (90, 360)
down = (500, 650)
right = (930, 410)

keyboard_map = {
    "f1": 112,
    "f2": 113,
    "f3": 114,
    "f4": 115,
    "f5": 116,
    "f6": 117,
    "f7": 118,
    "f8": 119,
    "f9": 120,
    "f10": 121,
    "f11": 122,
    "f12": 123,
    "0": 48,
    "1": 49,
    "2": 50,
    "3": 51,
    "4": 52,
    "5": 53,
    "6": 54,
    "7": 55,
    "8": 56,
    "9": 57,
    "-": 189,
    "=": 187,
    "b": 66,
    "q": 81,
    "shift": 16,
    "tab": 9,
    "w": 87,
    "s": 83,
    "a": 65,
    "d": 68,
    "m": 77,
    "end": 35,
    "enter": 13
}
